{
  "0": {
    "name": "Healthy",
    "description": "Leaf shows normal green coloration with no visible signs of nutrient stress.",
    "recommendation": "Maintain current agronomic practices, ensure balanced fertilization and good field hygiene."
  },
  "1": {
    "name": "boron-B",
    "description": "Boron deficiency causes thick, brittle, or deformed leaves, often with cracked stems and poor flowering.",
    "recommendation": "Apply boron-containing fertilizers (e.g., borax or Solubor) in small, carefully measured amounts to avoid toxicity."
  },
  "2": {
    "name": "calcium-Ca",
    "description": "Calcium deficiency leads to distorted young leaves, tip burn, and weak cell walls.",
    "recommendation": "Apply agricultural lime or gypsum to improve calcium availability and maintain proper soil pH."
  },
  "3": {
    "name": "iron-Fe",
    "description": "Iron deficiency causes interveinal chlorosis (yellowing between veins) on young leaves while veins remain green.",
    "recommendation": "Apply foliar iron chelates (Fe-EDDHA or Fe-DTPA) and ensure soil pH is not too alkaline."
  },
  "4": {
    "name": "magnesium-Mg",
    "description": "Magnesium deficiency shows as interveinal chlorosis on older leaves, with green veins and yellow tissue.",
    "recommendation": "Apply magnesium sulfate (Epsom salts) or dolomitic lime to replenish magnesium levels."
  },
  "5": {
    "name": "manganese-Mn",
    "description": "Manganese deficiency causes interveinal chlorosis with small necrotic spots, usually on younger leaves.",
    "recommendation": "Apply manganese sulfate or foliar Mn sprays, and avoid excessive liming that raises soil pH."
  },
  "6": {
    "name": "nitrogen-N",
    "description": "Nitrogen deficiency results in uniform yellowing of older leaves, stunted growth, and reduced vigor.",
    "recommendation": "Apply nitrogen fertilizers such as urea, ammonium nitrate, or organic manures in split doses."
  },
  "7": {
    "name": "phosphorus-P",
    "description": "Phosphorus deficiency causes dark green or purplish leaves, poor root growth, and delayed maturity.",
    "recommendation": "Apply phosphorus fertilizers like triple superphosphate (TSP) or diammonium phosphate (DAP)."
  },
  "8": {
    "name": "potasium-K",
    "description": "Potassium deficiency shows as leaf edge scorching, yellowing, and weak stems.",
    "recommendation": "Apply muriate of potash (KCl) or sulfate of potash (K2SO4) to restore potassium levels."
  }
}